benchmark-results/v0.2.0/perf/v020-host-vs-docker-reader-20260712_223747/docker-3.wrk.txt
Running 5s test @ https://127.0.0.1:4043/index.html
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.53ms    9.94ms 182.37ms   98.64%
    Req/Sec     5.81k   656.02     6.21k    97.87%
  55273 requests in 5.03s, 67.05MB read
Requests/sec:  10978.31
Transfer/sec:     13.32MB