benchmark-results/v0.2.0/perf/v020-host-vs-docker-reader-20260712_223747/docker-4.wrk.txt
Running 5s test @ https://127.0.0.1:4043/index.html
  2 threads and 100 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.11ms    7.47ms 157.37ms   98.92%
    Req/Sec     5.87k   625.03     6.06k    97.92%
  56926 requests in 5.10s, 69.06MB read
Requests/sec:  11171.92
Transfer/sec:     13.55MB